#Область СлужебныеПроцедурыИФункции

// Возвращает фильтр, используемый для выбора файлов-изображений.
//
// Возвращаемое значение:
//  Строка - строка, содержащая фильтр для файлов-изображений.
//
Функция ФильтрФайловИзображений() Экспорт
	Возврат НСтр("ru = 'Все картинки (*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf)|*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf
	||Все файлы(*.*)|*.*
	||Формат bmp(*.bmp*;*.dib;*.rle)|*.bmp;*.dib;*.rle
	||Формат GIF(*.gif*)|*.gif
	||Формат JPEG(*.jpeg;*.jpg)|*.jpeg;*.jpg
	||Формат PNG(*.png*)|*.png
	||Формат TIFF(*.tif)|*.tif
	||Формат icon(*.ico)|*.ico
	||Формат метафайл(*.wmf;*.emf)|*.wmf;*.emf'");
КонецФункции

Процедура РасчитатьСуммуСтрокиТЧ(СтрокаТЧ) Экспорт

	СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;

КонецПроцедуры

Процедура РасчитатьЦенуСтрокиТЧ(СтрокаТЧ) Экспорт

	Если СтрокаТЧ.Количество <> 0 Тогда
		СтрокаТЧ.Цена = СтрокаТЧ.Сумма / СтрокаТЧ.Количество;	
	КонецЕсли;

КонецПроцедуры


#КонецОбласти