
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//Себестоимость = Комплектующие.Итог("Себестоимость") / Количество;
	//Цена = ОбщегоНазначения.РасчитатьЦену(Себестоимость);
	//Прибыль = Цена - Прибыль;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если ГотоваяПродукция И НЕ ЗначениеЗаполнено(Цена) Тогда
		
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните цену";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыпускПродукцииКомплектующие.Номенклатура КАК Номенклатура,
		|	СУММА(ВыпускПродукцииКомплектующие.Количество) КАК Количество
		|ИЗ
		|	Документ.ВыпускПродукции.Комплектующие КАК ВыпускПродукцииКомплектующие
		|ГДЕ
		|	ВыпускПродукцииКомплектующие.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыпускПродукцииКомплектующие.Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ОстаткиТоваров.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Склад = СкладОтправитель;
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		
	КонецЦикла;
	
	Движение = Движения.ОстаткиТоваров.ДобавитьПриход();
	Движение.Период = Дата;               
	Движение.Склад = СкладПолучатель;
	Движение.Номенклатура = Номенклатура;
	Движение.Количество = Количество;
	
	Движения.Себестоимость.Записывать = Истина;
	Движение = Движения.Себестоимость.Добавить();
	Движение.Период = Дата;
	Движение.Номенклатура = Номенклатура;
	Движение.ЦенаЗаЕдиницу = Себестоимость;
	
	Если ГотоваяПродукция Тогда
		Движения.ЦеныНоменклатуры.Записывать = Истина;
		Движение = Движения.ЦеныНоменклатуры.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = Номенклатура;
		Движение.Цена = Цена;
	КонецЕсли;
КонецПроцедуры


